{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "int32", "name": "input_1", "batch_input_shape": [null, 1500], "sparse": false}}, {"name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Embedding", "config": {"name": "embedding_1", "mask_zero": false, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_constraint": null, "trainable": false, "input_dim": 27758, "output_dim": 100, "dtype": "float32", "input_length": 1500, "batch_input_shape": [null, 1500], "activity_regularizer": null}}, {"name": "reshape_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1500, 100, 1]}}, {"name": "conv2d_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 100], "name": "conv2d_1", "filters": 100, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null}}, {"name": "conv2d_2", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [4, 100], "name": "conv2d_2", "filters": 100, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null}}, {"name": "conv2d_3", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [5, 100], "name": "conv2d_3", "filters": 100, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [1498, 1]}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [1497, 1]}}, {"name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [1496, 1]}}, {"name": "concatenate_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": 1}}, {"name": "flatten_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "dropout_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}}, {"name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_1", "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activity_regularizer": null}}]}, "keras_version": "2.1.2"}